W13D4/todo-app/app/controllers/api/todos_controller.rb

  def update
    @todo = Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]