W9D3/cats_99/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "gray"], ["description", "        Extremely adorable \r\n    "], ["updated_at", "2019-08-28 23:44:06.962700"], ["id", 2]]