W9D5/music_app/app/controllers/albums_controller.rb

  def new
    @bands = Band.all
---
SELECT "bands".* FROM "bands"

  def create
    @bands = Band.all

    @album = Album.new(album_params)
    if @album.save
---
SELECT "bands".* FROM "bands"
INSERT INTO "albums" ("band_id", "title", "year", "created_at", "updated_at", "album_type") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["band_id", 4], ["title", "weird album"], ["year", 2019], ["created_at", "2019-08-30 22:57:49.933922"], ["updated_at", "2019-08-30 22:57:49.933922"], ["album_type", "Live"]]

  def edit
    @bands = Band.all
    @album = Album.find(params[:id])
---
SELECT "bands".* FROM "bands"
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @album = Album.find(params[:id])
    if @album.update_attributes(album_params)
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "album_type" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["album_type", "Live"], ["updated_at", "2019-08-30 21:58:58.917238"], ["id", 1]]

  def destroy
    album = Album.find(params[:id])
    band = album.band
    album.destroy!
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 1]]