W9D5/music_app/app/controllers/tracks_controller.rb

SELECT "albums".* FROM "albums"
---
  def new
    @track = Track.new
    @albums = Album.all

INSERT INTO "tracks" ("album_id", "title", "ord", "lyrics", "track_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @albums = Album.all
    @track = Track.new(track_params)
    if @track.save

SELECT "albums".* FROM "albums"
SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def edit
    @albums = Album.all
    @track = Track.find(params[:id])

SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def update
    @albums = Album.all
    @track = Track.find(params[:id])

SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 2]]
---
  def destroy
    track = Track.find(params[:id])
    album = track.album
    track.destroy!