W9D5/music_app/app/views/albums/show.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 1]]
---
    </tr>
    <%@album.tracks.each do |track|%>