W9D5/music_app/app/views/bands/show.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]
SELECT 1 AS one FROM "albums" WHERE "albums"."band_id" = $1 LIMIT $2  [["band_id", 2], ["LIMIT", 1]]
---

<% if @band.albums.empty? %>

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]
---
      <tr><th>Albums</th></tr>
      <%@band.albums.each do |album|%>